# Consultar bases de datos relacionales directamente con pandas.


Después de crear un motor de base de datos, podemos obtener los resultados de cualquier consulta usando solo 4 lineas de código:

* Conectadno.
* Ejecutando una consulta.
* Pasando los resultados a un DataFrame.
* Nombrando las columnas.


4 lineas de cóidgo esta ... okey pero podemos hacerlo aun mejor, en realidad podemos hacerlo en 1 línea, utilizaneo la función `read_sql_query` pasandole 2 argumentos:

In [96]:
from sqlalchemy import create_engine
import pandas as pd
engine = create_engine('sqlite:///Chinook.sqlite')

* El primer argumento será la consulta que deseamos hacer, en este caso `"SELECT * FROM Album"`

* El segundo argumento, sera el motor al que estamos conectados, en este caso `engine`.


Así podemos lograr lo mismo que haciendo 4 lineas de código.

In [99]:
df = pd.read_sql_query("SELECT * FROM Album",engine)

A continuación haremos algunos ejemplos para entender mejor como hacer consultas con Pandas.

Primero importaremos pandas y crearemos el motor SQLite 'Chinook.sqlite'. Luego, consultaremos la base de datos para seleccionar todos los registros de la tabla Álbum.

In [100]:
# Ejecutar consultas y almacenar registros en DataFrame: df
df = pd.read_sql_query("SELECT * FROM Album",engine)

# imprimir resultado del DataFrame
print(df.head())

# Abrir el motor en el administrador de contexto y almacenar el resultado de la consulta en df1
with engine.connect() as con:
    rs = con.execute("SELECT * FROM Album")
    df1 = pd.DataFrame(rs.fetchall())
    df1.columns = rs.keys()

# Confirmar que ambos métodos producen el mismo resultado.
print(df.equals(df1))

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3
True

## Pandas para consultas más complejas.

Aquí, nos familiarizaremos con la función pandas `read_sql_query()` al usarla para ejecutar una consulta más compleja: 

Una instrucción SELECT seguida de una cláusula WHERE y una cláusula ORDER BY. Construiremos un DataFrame que contiene las filas de la tabla Employee para las cuales EmployeeId es mayor o igual a 6 y ordenaremos estas entradas por Fecha de nacimiento.

In [101]:
# Ejecutar consultas y almacenar registros en DataFrame: df
df = pd.read_sql_query(
    "SELECT * FROM Employee WHERE EmployeeId >= 6 ORDER BY BirthDate",
    engine
)

# Imprmir DataFrame
print(df.head())

   EmployeeId  LastName  ...                Fax                    Email
0           8  Callahan  ...  +1 (403) 467-8772    laura@chinookcorp.com
1           7      King  ...  +1 (403) 456-8485   robert@chinookcorp.com
2           6  Mitchell  ...  +1 (403) 246-9899  michael@chinookcorp.com

[3 rows x 15 columns]